saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/NXP.MK22F51212_DFP.11.0.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <name>MK22F51212_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for MK22F51212</description>
  <url>http://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version="11.0.0">NXP CMSIS packs based on MCUXpresso SDK 2.5.0</release>
    <release version="10.0.3">A problem with missing components from some example the projects were dependent on was fixed (KEX-4241); Incorrect path to linked libraries were fixed: a pack version was a static part of the path and hadn’t worked for pack versions other than v10.0.0 (KEX-4373); A problem with incorrectly defined XIP_BOOT_HEADER_ENABLE, XIP_BOOT_HEADER_DCD_ENABLE and XIP_EXTERNAL_FLASH preprocessor symbols was fixed (KEX-4553); Missing flash algorithms for MK27, MK28, LPC802 and LPC804 device family packs were added (KEX-4659).</release>
    <release version="10.0.2">NXP CMSIS packs based on MCUXpresso SDK 2.4.0</release>
    <release version="10.0.1">NXP CMSIS packs based on MCUXpresso SDK 2.3.1</release>
    <release version="10.0.0">NXP CMSIS packs with updated Clear BSD license, based on MCUXpresso SDK 2.3.0. NXP CMSIS pack will maintain independent versioning starting with 10.0.0</release>
    <release version="2.3.0">NXP MCUXpresso SDK 2.3.0 CMSIS packs with updated Clear BSD license</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <taxonomy>
    <description Cclass="Device" Cgroup="SDK Project Template">NXP MCUXpresso SDK RTE Device Project Template</description>
    <description Cclass="Device" Cgroup="SDK Drivers">NXP MCUXpresso SDK Peripheral Drivers</description>
    <description Cclass="Device" Cgroup="SDK Utilities">NXP MCUXpresso SDK Utilities</description>
    <description Cclass="CMSIS Driver">NXP MCUXpresso SDK Peripheral CMSIS Drivers</description>
    <description Cclass="Board Support" Cgroup="SDK Project Template">NXP MCUXpresso SDK Project Template</description>
    <description Cclass="Device" Cgroup="Startup">NXP MCUXpresso SDK Start up</description>
  </taxonomy>
  <devices>
    <family Dfamily="MK22F51212" Dvendor="NXP:11">
      <description>Kinetis® K22 MCUs have been optimized for cost-sensitive applications requiring low power flexibility and processing efficiency.Delivers industry-leading low power while providing significant bill-of-materials savings through smart on-chip integration.Includes options that support crystal-less USB design for reduced system cost and board space.Provides scalability with various levels of integration, offering a rich suite of analog, communication, timing and control peripherals to accommodate a wide range of requirements.Shares the comprehensive enablement and scalability of the Kinetis portfolio.</description>
      <device Dname="MK22FN512xxx12">
        <processor Dcore="Cortex-M4" Dfpu="SP_FPU" Dendian="Little-endian" Dclock="120000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MK22FN512xxx12_flash.icf"/>
        </environment>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x080000" access="rx" default="1" startup="1"/>
        <memory name="SRAM_LOWER" start="0x1fff0000" size="0x010000" access="rw"/>
        <memory name="SRAM_UPPER" start="0x20000000" size="0x010000" access="rw" default="1"/>
        <algorithm name="arm/MK_P512.FLM" start="0x00000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
        <algorithm name="arm/MK2x_FAC.FLM" start="0xffff0000" size="0x00000024" RAMstart="0x20000000" RAMsize="0x00001000" default="0"/>
        <debug svd="MK22F51212.xml"/>
        <variant Dvariant="MK22FN512VDC12">
          <compile header="fsl_device_registers.h" define="CPU_MK22FN512VDC12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK22FN512VDC12/MK22FN512xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK22FN512VLL12">
          <compile header="fsl_device_registers.h" define="CPU_MK22FN512VLL12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK22FN512VLL12/MK22FN512xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK22FN512VLH12">
          <compile header="fsl_device_registers.h" define="CPU_MK22FN512VLH12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK22FN512VLH12/MK22FN512xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK22FN512VFX12">
          <compile header="fsl_device_registers.h" define="CPU_MK22FN512VFX12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK22FN512VFX12/MK22FN512xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK22FN512CAP12">
          <compile header="fsl_device_registers.h" define="CPU_MK22FN512CAP12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK22FN512CAP12/MK22FN512xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK22FN512VMP12">
          <compile header="fsl_device_registers.h" define="CPU_MK22FN512VMP12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK22FN512VMP12/MK22FN512xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="cond_MCUXpressoConfigTools">
      <accept Dname="MK22FN512???12" Dvendor="NXP:11"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="device.MK22F51212_AND_driver.dmamux_AND_driver.edma">
      <accept Dname="MK22FN512???12" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
    </condition>
    <condition id="device.MK22F51212_AND_driver.edma_AND_driver.sai">
      <accept Dname="MK22FN512???12" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="sai"/>
    </condition>
